# Найти корень третьей степени из 343

print(int(input("Введите число для расчета его кубического корня: ")) ** (1/3))