# Написать произвольную анкеты, и вывести полученные данные

name_input = input('Введите имя тут: ')
print(f'Привет, {name_input}!')